export default {
  projections: {
    ГрафикРаботыE: {
      числоЧасов: {
        __caption__: 'Число часов'
      },
      времяНачала: {
        __caption__: 'Время начала'
      },
      времяКонца: {
        __caption__: 'Время конца'
      },
      типЗанятости: {
        __caption__: 'Тип занятости'
      },
      сотрудник: {
        __caption__: 'Сотрудник',
        фИО: {
          __caption__: 'ФИО'
        }
      }
    },
    ГрафикРаботыL: {
      числоЧасов: {
        __caption__: 'Число часов'
      },
      времяНачала: {
        __caption__: 'Время начала'
      },
      времяКонца: {
        __caption__: 'Время конца'
      },
      типЗанятости: {
        __caption__: 'Тип занятости'
      },
      сотрудник: {
        __caption__: 'ФИО',
        фИО: {
          __caption__: 'ФИО'
        }
      }
    }
  },
  validations: {
    времяКонца: {
      __caption__: 'Время конца'
    },
    времяНачала: {
      __caption__: 'Время начала'
    },
    типЗанятости: {
      __caption__: 'Тип занятости'
    },
    числоЧасов: {
      __caption__: 'Число часов'
    },
    сотрудник: {
      __caption__: 'Сотрудник'
    }
  }
};
