export default {
  projections: {
    ТабельСменыE: {
      дата: {
        __caption__: 'Дата'
      },
      началоСмены: {
        __caption__: 'Начало смены'
      },
      конецСмены: {
        __caption__: 'Конец смены'
      },
      типЗанятости: {
        __caption__: 'Тип занятости'
      },
      сотрудник: {
        __caption__: 'Сотрудник',
        фИО: {
          __caption__: 'ФИО'
        }
      }
    },
    ТабельСменыL: {
      дата: {
        __caption__: 'Дата'
      },
      началоСмены: {
        __caption__: 'Начало смены'
      },
      конецСмены: {
        __caption__: 'Конец смены'
      },
      типЗанятости: {
        __caption__: 'Тип занятости'
      },
      сотрудник: {
        __caption__: 'ФИО',
        фИО: {
          __caption__: 'ФИО'
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата'
    },
    конецСмены: {
      __caption__: 'Конец смены'
    },
    началоСмены: {
      __caption__: 'Начало смены'
    },
    типЗанятости: {
      __caption__: 'Тип занятости'
    },
    сотрудник: {
      __caption__: 'Сотрудник'
    }
  }
};
